src/InformationRegisters/EMS_СообщенияСинхронизации/EMS_СообщенияСинхронизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>EMS_СообщенияСинхронизации</name>
  <resources>
    <name>ВидДанныхДляРегистрации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПолноеИмяМетаданных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КлючРегистрацииОтбор</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ДанныеВнешнейБазы</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>СтатусОтправки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтатусРегистрации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторПакета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КлючСтроки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сообщение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>База</name>
    <type>
      <types>CatalogRef.EMS_ПараметрыБаз</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Тип</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Вид</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЗаписи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/EMS_ОбъектыМетаданных/EMS_ОбъектыМетаданных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>EMS_ОбъектыМетаданных</name>
  <resources>
    <name>Выбран</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Представление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодУИД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТипУИД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Иерархический</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Владелец</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПолеОрганизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОсновныеПоляДляСверки</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ДополнительныеПоляДляСверки</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектМетаданных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Вид</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПараметрыБазы</name>
    <type>
      <types>CatalogRef.EMS_ПараметрыБаз</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/EMS_ПараметрыБаз/EMS_ПараметрыБаз.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>EMS_ПараметрыБаз</name>
  <attributes>
    <name>Proxy</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SSL</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WSИмяБазы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WSИмяСервера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОрганизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеУзлаИБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/CommonModules/EMS_ПроверкаСинхронизации/Module.bsl
// Получаем список баз НЗ, обходим в цикле, у них заполнены поля КодОрганизации, НаименованиеУзлаИБ
	// Получаем соответстсвия объектов с разными ГУИДАМИ (СоответствияОбъектовИнформационныхБаз) по узлу ИБ
	// Получаем объекты метаданныхиз EMS_ОбъектыМетаданных с отбором по базе для сравнения, обходим в цикле
		// Получаем данные НЗ по объекту метаданных, передааем в параметрах код сопоставления организации(Обсудить необходимость)
		// Получаем данные локальной базы ВЗ по объекту метаданных
		// Преобразуем ключи для сравнения
		// Проверяем есть ли в выборке локальной ключи из внешней, если нет выводим "В<Л", параметр право в настройках HTTPВыборки
		// Пишем в регистр EMS_СообщенияСинхронизации
		
// Объект не найден в сообщениях в результате ЗначениеИзСтрокиВнутр(Стр);
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
Процедура ВыполнитьСинхронизацию(Отладка = Ложь) Экспорт
	Базы = БазыДляСинхронизации(); 
	НаборЗаписейСообщений = РегистрыСведений.EMS_СообщенияСинхронизации.СоздатьНаборЗаписей();
	Для Каждого База Из Базы Цикл
		Если Отладка Тогда
			Сообщить("=== Начало выборки " + База.Ссылка + " ===");     
		КонецЕсли;
		ДанныеБазы = КонструкторСтруктурыДанныеБазы();
		ДанныеБазы.База = База;
		ДанныеБазы.Отладка = Отладка;
		ДанныеБазы.Соединение = ПолучитьПодключениеHTTPСервер(ДанныеБазы.База);
		ДанныеБазы.КэшТипы = Новый Структура("Наружу, Внутрь", Новый Соответствие, Новый Соответствие);
		Если ДанныеБазы.Соединение = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ДанныеБазы.СоответсвиеОбъектов = СоответствияОбъектовБазы(ДанныеБазы.База); 
		ДанныеБазы.ОбъектыМетаданных = ОбъектыМетаданныхБазы(ДанныеБазы.База);
		Обороты(ДанныеБазы, НаборЗаписейСообщений);  
	КонецЦикла; 
	НаборЗаписейСообщений.Записать();
КонецПроцедуры  

// Регистрирует к обмену объекты, которые есть в базе-источнике, но не найдены в текущей базе.
// Данные об объектах берутся из регистра EMS_СообщенияСинхронизации - строки с текстом
// "<Объект не найден>". Регистрация выполняется на стороне базы-источника по HTTP,
// чтобы объекты попали в текущую базу при очередном обмене.
//
// Параметры:
//  База - СправочникСсылка.EMS_ПараметрыБаз - база, по которой берутся расхождения.
//         Если не заполнена, возвращается результат с подсказкой выбрать базу.
//
// Возвращаемое значение:
//  ТаблицаЗначений - результат регистрации:
//    * ПолноеИмяМетаданных - Строка - полное имя объекта метаданных;
//    * УникальныйИдентификатор - Строка - ГУИД объекта;
//    * Результат - Строка - результат регистрации.
//
Функция ЗарегистрироватьОбъектыКОбмену(База) Экспорт

	ТаблицаРезультата = ТаблицаРезультатаРегистрации();
	Если Не ЗначениеЗаполнено(База) Тогда
		ДобавитьРезультатРегистрации(ТаблицаРезультата, "", "",
			"Не выбрана база. Выделите строку в сообщениях синхронизации.");
		Возврат ТаблицаРезультата;
	КонецЕсли;

	ЭлементыПакета = Новый Массив;
	ОписанияЭлементов = Новый Массив;
	ЗаполнитьПакетРегистрации(База, ЭлементыПакета, ОписанияЭлементов, ТаблицаРезультата);

	Если ЭлементыПакета.Количество() = 0 Тогда
		Возврат ТаблицаРезультата;
	КонецЕсли;

	ДанныеБазы = КонструкторСтруктурыДанныеБазы();
	ДанныеБазы.База = ПараметрыБазыПоСсылке(База);
	Если ДанныеБазы.База = Неопределено Тогда
		ДобавитьРезультатРегистрации(ТаблицаРезультата, "", "",
			"База не найдена среди актуальных параметров баз.");
		Возврат ТаблицаРезультата;
	КонецЕсли;

	ДанныеБазы.Отладка = Ложь;
	ДанныеБазы.Соединение = ПолучитьПодключениеHTTPСервер(ДанныеБазы.База);
	Если ДанныеБазы.Соединение = Неопределено Тогда
		ДобавитьРезультатРегистрации(ТаблицаРезультата, "", "",
			"Не удалось установить HTTP-соединение с базой.");
		Возврат ТаблицаРезультата;
	КонецЕсли;

	ДанныеЗапроса = Новый Структура("ЭлементыПакета", ЭлементыПакета);
	ПутьРегистрации = ДанныеБазы.База.WSИмяБазы + "/hs/sverka/V1/register-changes";

	Попытка
		Ответ = ЗапросКБазеПриемнику(ДанныеБазы, "", ДанныеЗапроса, ПутьРегистрации);
	Исключение
		ДобавитьРезультатРегистрации(ТаблицаРезультата, "", "",
			"Ошибка регистрации: " + ОписаниеОшибки());
		Возврат ТаблицаРезультата;
	КонецПопытки;

	РазобратьРезультатРегистрации(Ответ, ОписанияЭлементов, ТаблицаРезультата);

	Возврат ТаблицаРезультата;

КонецФункции

// Заполняет регистр сведений EMS_ОбъектыМетаданных строками по объектам метаданных,
// входящим в состав плана обмена с указанным именем или синонимом, в разрезе актуальных параметров баз.
// Существующие записи регистра не изменяются - добавляются только недостающие.
//
// Параметры:
//  НаименованиеПланаОбмена - Строка - имя или синоним плана обмена.
//
// Возвращаемое значение:
//  Структура - результат заполнения:
//    * ДобавленоСтрок - Число - количество добавленных записей регистра;
//    * ВсегоОбъектов  - Число - количество объектов метаданных в составе плана обмена;
//    * Баз            - Число - количество обработанных параметров баз;
//    * ПланНайден     - Булево - план обмена найден в метаданных текущей конфигурации.
//
Функция ЗаполнитьОбъектыМетаданныхПоПлануОбмена(НаименованиеПланаОбмена) Экспорт

	ПланОбмена = ПланОбменаПоНаименованию(НаименованиеПланаОбмена);
	ОписаниеОбъектов = ОписаниеОбъектовПланаОбмена(ПланОбмена);
	Базы = Справочники.EMS_ПараметрыБаз.СписокАктуальныхБаз();

	Результат = Новый Структура;
	Результат.Вставить("ДобавленоСтрок", 0);
	Результат.Вставить("ВсегоОбъектов", ОписаниеОбъектов.Количество());
	Результат.Вставить("Баз", Базы.Количество());
	Результат.Вставить("ПланНайден", ПланОбмена <> Неопределено);

	Если ПланОбмена = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;

	Для Каждого ПараметрыБазы Из Базы Цикл

		НаборЗаписей = РегистрыСведений.EMS_ОбъектыМетаданных.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ПараметрыБазы.Установить(ПараметрыБазы);
		НаборЗаписей.Прочитать();

		СуществующиеЗаписи = Новый Соответствие;
		Для Каждого ЗаписьРегистра Из НаборЗаписей Цикл
			СуществующиеЗаписи.Вставить(КлючЗаписиРегистра(ЗаписьРегистра), Истина);
		КонецЦикла;

		ДобавленоПоБазе = 0;
		Для Каждого ОписаниеОбъекта Из ОписаниеОбъектов Цикл

			Если СуществующиеЗаписи.Получить(КлючЗаписиРегистра(ОписаниеОбъекта)) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;

			НоваяЗапись = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись, ОписаниеОбъекта);
			НоваяЗапись.ПараметрыБазы = ПараметрыБазы;
			ДобавленоПоБазе = ДобавленоПоБазе + 1;

		КонецЦикла;

		Если ДобавленоПоБазе > 0 Тогда
			НаборЗаписей.Записать();
			Результат.ДобавленоСтрок = Результат.ДобавленоСтрок + ДобавленоПоБазе;
		КонецЕсли;

	КонецЦикла;

	Возврат Результат;

КонецФункции

// По фрагментам "<Объект не найден>" определяет вид метаданных верхней базы
// и запрашивает представление объекта в нижней базе.
//
// Параметры:
//  База - СправочникСсылка.EMS_ПараметрыБаз - нижняя база;
//  Фрагменты - Массив из Строка - уникальные фрагменты сообщений.
//
// Возвращаемое значение:
//  Соответствие из КлючИЗначение - ключ: фрагмент, значение: структура ВидМетаданных, Представление.
//
Функция ОписанияОбъектовНеНайден(База, Фрагменты) Экспорт

	Описания = Новый Соответствие;
	КодыТипов = КодыТиповСсылок();
	ЭлементыЗапроса = Новый Массив;
	ФрагментыЗапроса = Новый Массив;

	Для Каждого Фрагмент Из Фрагменты Цикл

		Описание = Новый Структура("ВидМетаданных, Представление", "", "");
		Разбор = РазобратьФрагментОбъектНеНайден(Фрагмент);
		Если Разбор <> Неопределено Тогда
			ПолноеИмя = КодыТипов.Получить(Разбор.КодТипа);
			Если ПолноеИмя = Неопределено Тогда
				Попытка
					ПолноеИмя = КодыТипов.Получить(Формат(Число(Разбор.КодТипа), "ЧГ=0"));
				Исключение
					ПолноеИмя = Неопределено;
				КонецПопытки;
			КонецЕсли;
			Если ПолноеИмя <> Неопределено Тогда
				Описание.ВидМетаданных = ВидМетаданныхДляОтчета(ПолноеИмя);
				ЭлементыЗапроса.Добавить(Новый Структура(
					"Индекс, ПолноеИмя, ГУИД", ФрагментыЗапроса.Количество(), ПолноеИмя, Разбор.ГУИД));
				ФрагментыЗапроса.Добавить(Фрагмент);
			КонецЕсли;
		КонецЕсли;
		Описания.Вставить(Фрагмент, Описание);

	КонецЦикла;

	ЗаполнитьПредставленияИзНижнейБазы(База, ЭлементыЗапроса, ФрагментыЗапроса, Описания);

	Возврат Описания;

КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СообщитьМассив(Выб)
		Сообщить("Массив (" + Выб.Количество() + ")");
КонецПроцедуры

Процедура Обороты(ДанныеБазы, НаборЗаписейСообщений)
	Для Каждого ОбъектМетаданных Из ДанныеБазы.ОбъектыМетаданных Цикл 
		Рез = Новый Массив;
		Если ДанныеБазы.Отладка Тогда
			Сообщить("=== Метаданные " + ОбъектМетаданных.Вид + " ==="); 
		КонецЕсли;
		Попытка
			соРазница =  ОборотыОбъект(ДанныеБазы, ОбъектМетаданных, НаборЗаписейСообщений);
			ОбъединитьРез(соРазница, Рез, ОбъектМетаданных.Тип); 
		Исключение
		КонецПопытки;  
		Если ДанныеБазы.Отладка Тогда
			СообщитьМассив(Рез);
		КонецЕсли;
	КонецЦикла;  
КонецПроцедуры

Функция ОборотыОбъект(ДанныеБазы, ОбъектМетаданных, НаборЗаписейСообщений)  
	База = ДанныеБазы.База;
	СчетКод="";
	Результат = "Выборка";
	Режим="Разница";  
	Рез = Новый Структура;
	Если  ОбъектМетаданных.Тип = "РегистрыРасчета" Тогда 
		Шаблон = ПолучитьШаблонЗапроса(СчетКод,"зуп");
		Текст = СтрЗаменить(Шаблон, "&Условие", " Где ГоловнаяОрганизация В ИЕРАРХИИ (&Организация)"); 
		Поля =  СтрРазделить("Регистратор,Сотрудник,ФизическоеЛицо,ГоловнаяОрганизация,СторноТекущегоПериода,Результат",",",Ложь);
		Рез.Вставить("мИзмерения", Поля);
		Рез.Вставить("ЗапросТекст", Текст);  
		Рез.Вставить("Тип", "РегистрыРасчета");
	Иначе 
		Рез   =   ОбъектыВыборкаОтбор(ОбъектМетаданных); 
		Поля  =   Рез.мИзмерения;
		Текст =   Рез.ЗапросТекст;
	КонецЕсли;
	
	ЗапросПараметры = Новый Структура;
	ЗапросПараметры.Вставить("Организация", База.КодОрганизации);  
	ЗапросПараметры.Вставить("НачалоПериода", '20260101');
	ЗапросПараметры.Вставить("КонецПериода" , '20280101');
	
	Если Рез.Тип = "РегистрБухгалтерии" Или Рез.Тип = "РегистрНакопления" или Рез.Тип = "РегистрыРасчета"  Тогда
		ИнРег = Поля.Найти("Регистратор");
	Иначе  
		ИнРег = Неопределено;  
	КонецЕсли;
	соРазница = ПолучитьРезультат(Текст, Поля, ЗапросПараметры, ИнРег, Рез, ДанныеБазы, ОбъектМетаданных, НаборЗаписейСообщений);
	
	Если ИнРег = Неопределено  Тогда
		Рез.Вставить("Выборка", соРазница);
		Если Рез.Тип = "РегистрыСведений" Тогда 	
			МассивИзВыборки(Рез, ДанныеБазы); 
			Возврат Рез.Результат;
		КонецЕсли;
	КонецЕсли;
	
	Возврат соРазница

КонецФункции

Функция ПолучитьРезультат(Текст, Поля, ЗапросПараметры, Индекс, Рез, ДанныеБазы, ОбъектМетаданных, НаборЗаписейСообщений)
 
	Локал = ВыполнитьЗапрос(Текст, Поля, ЗапросПараметры, ДанныеБазы);
	Внешн = ВыполнитьЗапросВнешний(Текст, Поля, ЗапросПараметры, Истина, ДанныеБазы);
	
	ИнСбк1 = Поля.Найти("ИдентификаторЗаписи");
	соЛокал = ПолучитьКлючиСтр(Локал, ИнСбк1);
	соВнешн = ПолучитьКлючиСтр(Внешн, ИнСбк1);
	Выборка = ПолучитьРазницуПоКлючам(соЛокал, соВнешн, Индекс, ДанныеБазы, ОбъектМетаданных, НаборЗаписейСообщений);
	Если Рез.Тип = "Справочники" или Рез.Тип = "Документы" или  Индекс <> Неопределено Тогда
		Возврат СтуктураВИзСтрокиВнутрНорм(Выборка);
	Иначе 
		Возврат Выборка;	
	КонецЕсли;
		
КонецФункции

Функция ВыполнитьЗапросВнешний(ЗапросТекст, Поля, ЗапросПараметры, АдаптироватьПоСоответствиям, ДанныеБазы)
	
	ЗапросПараметрыВнешний = СтуктураВИзСтрокиВнутр(ЗапросПараметры, Истина);
	
	ПараметрыДляHTTP = Новый Структура;
	Для Каждого ТекПар Из ЗапросПараметры Цикл
		Зн = ТекПар.Значение;
		Если ТекПар.Ключ = "Организация" И ТипЗнч(Зн) = Тип("Строка") Тогда
			Зн = ОбменДаннымиПереопределяемый.ИдентификаторОрганизацииДляВнешнегоЗапроса(Зн);
		КонецЕсли;
		ПараметрыДляHTTP.Вставить(ТекПар.Ключ, Зн);
	КонецЦикла;

	ДанныеЗапроса = Новый Структура();
	ДанныеЗапроса.Вставить("ЗапросПараметры", ПараметрыДляHTTP);
	ДанныеЗапроса.Вставить("ЗапросТекст",ЗапросТекст); 
	ДанныеЗапроса.Вставить("Поля",Поля);
	
	Путь = "";
	Рез  = ЗапросКБазеПриемнику(ДанныеБазы, "V1/Список", ДанныеЗапроса, Путь);
	Выб  = Рез[0];
	мТипы = новый Соответствие;
	тВыб = Рез[1]; 
	Для каждого стр Из тВыб Цикл
		мТипы.Вставить( стр[0], стр[1]);
	КонецЦикла;
	
	мРезультат = Новый Массив;
	Для Каждого ТекСтр Из Выб Цикл
		мСтр = Новый Массив;
		Для Каждого Зн Из ТекСтр Цикл
			мСтр.Добавить(Зн);
		КонецЦикла;
		мРезультат.Добавить(мСтр);
	КонецЦикла;     
	мРезультат = АдаптироватьHTTP(мРезультат, Ложь, ДанныеБазы.СоответсвиеОбъектов.ЛокальнаяВоВнешнюю, ДанныеБазы.КэшТипы.Внутрь,мТипы);
	
	Возврат мРезультат;
КонецФункции  

Функция КонструкторСтруктурыДанныеБазы()
	Возврат Новый Структура("Соединение, База, СоответсвиеОбъектов, ОбъектыМетаданных, КэшТипы, Отладка");	
КонецФункции

#Область ПолучениеДанных
   
Функция БазыДляСинхронизации()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	EMS_ПараметрыБаз.Proxy КАК Proxy,
		|	EMS_ПараметрыБаз.SSL КАК SSL,
		|	EMS_ПараметрыБаз.WSИмяБазы КАК WSИмяБазы,
		|	EMS_ПараметрыБаз.WSИмяСервера КАК WSИмяСервера,
		|	EMS_ПараметрыБаз.КодОрганизации КАК КодОрганизации,
		|	EMS_ПараметрыБаз.НаименованиеУзлаИБ КАК НаименованиеУзлаИБ,
		|	EMS_ПараметрыБаз.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.EMS_ПараметрыБаз КАК EMS_ПараметрыБаз
		|ГДЕ
		|	EMS_ПараметрыБаз.КодОрганизации <> """"
		|	И EMS_ПараметрыБаз.НаименованиеУзлаИБ <> """"";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Логин = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища("СинхронизацияEMS", "Логин");
	Пароль = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища("СинхронизацияEMS", "Пароль");
	Базы = Новый Массив;
	Пока Выборка.Следующий() Цикл
		БазаДляСинхронизации = КонструкторСтруктурыБазыДляСинхронизации();
		ЗаполнитьЗначенияСвойств(БазаДляСинхронизации, Выборка);  
		БазаДляСинхронизации.WSИмяПользователя = Логин;
		БазаДляСинхронизации.WSПароль = Пароль;
		Базы.Добавить(БазаДляСинхронизации);
	КонецЦикла;
	Возврат Базы;	
КонецФункции                  

Функция КонструкторСтруктурыБазыДляСинхронизации()
	Возврат Новый Структура("Proxy, SSL, WSИмяБазы, WSИмяПользователя, WSИмяСервера, WSПароль, КодОрганизации, НаименованиеУзлаИБ, Ссылка");	
КонецФункции 

Функция СоответствияОбъектовБазы(База)
	
	Запрос = Новый Запрос;
	Запрос.Текст =   "ВЫБРАТЬ
	|	СоответствияОбъектовИнформационныхБаз.ТипИсточника КАК ТипИсточника,
	|	СоответствияОбъектовИнформационныхБаз.УникальныйИдентификаторПриемника КАК УникальныйИдентификаторПриемника,
	|	СоответствияОбъектовИнформационныхБаз.УникальныйИдентификаторИсточникаСтрокой КАК УникальныйИдентификаторИсточника
	|ИЗ
	|	РегистрСведений.СоответствияОбъектовИнформационныхБаз КАК СоответствияОбъектовИнформационныхБаз
	|ГДЕ
	|	СоответствияОбъектовИнформационныхБаз.УзелИнформационнойБазы.Наименование = &НаименованиеУзлаИБ
	|	И СоответствияОбъектовИнформационныхБаз.УникальныйИдентификаторПриемника <> СоответствияОбъектовИнформационныхБаз.УникальныйИдентификаторИсточникаСтрокой";
	
	
	Запрос.УстановитьПараметр("НаименованиеУзлаИБ", База.НаименованиеУзлаИБ);
	Выборка = Запрос.Выполнить().Выбрать();
	мИзмерения = СтрРазделить("ТипИсточника, УникальныйИдентификаторПриемника, УникальныйИдентификаторИсточника", ", ", Ложь); 
	мРезультат = Новый Массив;
	Пока Выборка.Следующий() Цикл
		Стр = Новый Массив;
		Для Каждого Изм Из мИзмерения Цикл
			Если ТипЗнч(Выборка[Изм]) = Тип("УникальныйИдентификатор") Тогда
				Зн = Строка(Выборка[Изм]);
				Стр.Добавить(ЗначениеВСтрокуВнутр(Зн));	
			Иначе 	
				Стр.Добавить(ЗначениеВСтрокуВнутр(Выборка[Изм]));
				
			КонецЕсли;
		КонецЦикла;
		мРезультат.Добавить(Стр);
	КонецЦикла; 
	
	Результат = Новый Массив;
	Для Каждого эл Из мРезультат Цикл
		Стр = Новый Массив;
		ТипСтр  =    ЗначениеИзСтрокиВнутр(эл[0]);
		СтрокаПриемник =   ЗначениеИзСтрокиВнутр(эл[1]);
		СтрокаПриемникВнутр = СтрокаИзУИД(ТипСтр, СтрокаПриемник);    
		Стр.Добавить(СтрокаПриемникВнутр); 
		СтрокаИсточник =   ЗначениеИзСтрокиВнутр(эл[2]);  
		СтрокаИсточникВнутр = СтрокаИзУИД(ТипСтр, СтрокаИсточник);    
		Стр.Добавить(СтрокаИсточникВнутр);
		Результат.Добавить(Стр);
	КонецЦикла;  
	
	СоответствияОбъектовИнформационныхБаз = Новый Структура("ВнешняяВЛокальную, ЛокальнаяВоВнешнюю", Новый Соответствие, Новый Соответствие);
	Для каждого мСтр Из Результат  Цикл		
		Внешн = мСтр[1];
		Локал = мСтр[0];
		
		СоответствияОбъектовИнформационныхБаз.ВнешняяВЛокальную.Вставить(Внешн, Локал);
		СоответствияОбъектовИнформационныхБаз.ЛокальнаяВоВнешнюю.Вставить(Локал, Внешн);
	КонецЦикла; 
	
	Возврат СоответствияОбъектовИнформационныхБаз;
	
КонецФункции

Функция СтрокаИзУИД(ТипСтр, УИД)
    Тип = Тип(ТипСтр);
    
    СтрПустое = ЗначениеВСтрокуВнутр(XMLЗначение(Тип, "00000000-0000-0000-0000-000000000000"));
    
    Стр = УИД;
    // 123456789012345678901234567890123456
    // 1435823d-b0b3-11ec-9871-0050568d2260
    // 98710050568d226011ecb0b31435823d
    Стр = ""
        + Сред(Стр, 20,  4)
        + Сред(Стр, 25, 12)
        + Сред(Стр, 15,  4)
        + Сред(Стр, 10,  4)
        + Сред(Стр,  1,  8)
    ;
    Стр = СтрЗаменить(СтрПустое, "00000000000000000000000000000000", Стр);
    
    Возврат Стр;
КонецФункции

Функция ОбъектыМетаданныхБазы(База)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	EMS_ОбъектыМетаданных.ОбъектМетаданных КАК Тип,
	|	EMS_ОбъектыМетаданных.Вид КАК Вид,
	|	EMS_ОбъектыМетаданных.ПолеОрганизации КАК ПолеОрганизации
	|ИЗ
	|	РегистрСведений.EMS_ОбъектыМетаданных КАК EMS_ОбъектыМетаданных
	|ГДЕ
	|	EMS_ОбъектыМетаданных.ПараметрыБазы = &ПараметрыБазы
	|	И EMS_ОбъектыМетаданных.Выбран";
	
	Запрос.УстановитьПараметр("ПараметрыБазы", База.Ссылка); 
	Выборка = Запрос.Выполнить().Выбрать();
	ОбъектыМетаданных = Новый Массив;
	Пока Выборка.Следующий() Цикл
		ОбъектМетаданных = КонструкторСтруктурыОбъектыМетаданныхДляБазы();
		ЗаполнитьЗначенияСвойств(ОбъектМетаданных, Выборка);
		ОбъектыМетаданных.Добавить(ОбъектМетаданных);
	КонецЦикла; 
	Возврат ОбъектыМетаданных;
КонецФункции 

Функция КонструкторСтруктурыОбъектыМетаданныхДляБазы()
	Возврат Новый Структура("Тип, Вид, ПолеОрганизации");	
КонецФункции

// Возвращает ключ записи регистра EMS_ОбъектыМетаданных по объекту метаданных и его виду.
//
// Параметры:
//  ДанныеЗаписи - РегистрСведенийЗапись.EMS_ОбъектыМетаданных, Структура - запись регистра или описание объекта метаданных.
//
// Возвращаемое значение:
//  Строка - ключ вида "Справочники.ФизическиеЛица".
//
Функция КлючЗаписиРегистра(ДанныеЗаписи)
	Возврат ДанныеЗаписи.ОбъектМетаданных + "." + ДанныеЗаписи.Вид;
КонецФункции

// Возвращает описание объектов метаданных, входящих в состав указанного плана обмена.
//
// Возвращаемое значение:
//  Массив из Структура - описание объекта метаданных:
//    * ОбъектМетаданных - Строка - имя вида метаданных во множественном числе, например "Справочники";
//    * Вид              - Строка - имя объекта метаданных, например "ФизическиеЛица";
//    * Представление    - Строка - синоним объекта метаданных;
//    * Иерархический    - Булево - признак иерархического справочника;
//    * Владелец         - Булево - признак наличия владельца у справочника;
//    * Выбран           - Булево - признак участия объекта в сверке;
//    * ПолеОрганизации  - Строка - имя реквизита со ссылкой на организацию.
//
Функция ПланОбменаПоНаименованию(НаименованиеПланаОбмена) Экспорт

	ИмяПланаОбмена = СокрЛП(Строка(НаименованиеПланаОбмена));
	Если Не ЗначениеЗаполнено(ИмяПланаОбмена) Тогда
		Возврат Неопределено;
	КонецЕсли;

	ПланОбмена = Метаданные.ПланыОбмена.Найти(ИмяПланаОбмена);
	Если ПланОбмена <> Неопределено Тогда
		Возврат ПланОбмена;
	КонецЕсли;

	ИмяДляСравнения = НРег(ИмяПланаОбмена);
	Для Каждого ПланОбменаКонфигурации Из Метаданные.ПланыОбмена Цикл
		Если НРег(ПланОбменаКонфигурации.Имя) = ИмяДляСравнения
			Или НРег(ПланОбменаКонфигурации.Представление()) = ИмяДляСравнения Тогда
			Возврат ПланОбменаКонфигурации;
		КонецЕсли;
	КонецЦикла;

	Возврат Неопределено;

КонецФункции

Функция ОписаниеОбъектовПланаОбмена(ПланОбмена)

	ВидыМетаданных = Новый Соответствие;
	ВидыМетаданных.Вставить("Справочник", "Справочники");
	ВидыМетаданных.Вставить("Документ", "Документы");
	ВидыМетаданных.Вставить("РегистрСведений", "РегистрыСведений");
	ВидыМетаданных.Вставить("РегистрНакопления", "РегистрыНакопления");
	ВидыМетаданных.Вставить("ПланВидовХарактеристик", "ПланыВидовХарактеристик");
	ВидыМетаданных.Вставить("Последовательность", "Последовательности");
	ВидыМетаданных.Вставить("РегистрРасчета", "РегистрыРасчета");

	ОписаниеОбъектов = Новый Массив;

	Если ПланОбмена = Неопределено Тогда
		Возврат ОписаниеОбъектов;
	КонецЕсли;

	Для Каждого ЭлементСостава Из ПланОбмена.Состав Цикл

		ОбъектМетаданных = ЭлементСостава.Метаданные;
		ЧастиИмени = СтрРазделить(ОбъектМетаданных.ПолноеИмя(), ".", Ложь);
		Если ЧастиИмени.Количество() < 2 Тогда
			Продолжить;
		КонецЕсли;

		ВидМетаданных = ВидыМетаданных.Получить(ЧастиИмени[0]);
		Если ВидМетаданных = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Если ОбъектИсключенИзЗаполнения(ВидМетаданных, ОбъектМетаданных.Имя) Тогда
			Продолжить;
		КонецЕсли;

		ОписаниеОбъекта = Новый Структура;
		ОписаниеОбъекта.Вставить("ОбъектМетаданных", ВидМетаданных);
		ОписаниеОбъекта.Вставить("Вид", ОбъектМетаданных.Имя);
		ОписаниеОбъекта.Вставить("Представление", ОбъектМетаданных.Представление());
		ОписаниеОбъекта.Вставить("Иерархический", Ложь);
		ОписаниеОбъекта.Вставить("Владелец", Ложь);
		ОписаниеОбъекта.Вставить("Выбран", Истина);
		ОписаниеОбъекта.Вставить("ПолеОрганизации", ПолеОрганизацииОбъектаМетаданных(ОбъектМетаданных, ВидМетаданных));

		Если ВидМетаданных = "Справочники" Тогда
			ОписаниеОбъекта.Иерархический = ОбъектМетаданных.Иерархический;
			ОписаниеОбъекта.Владелец = ОбъектМетаданных.Владельцы.Количество() > 0;
		КонецЕсли;

		ОписаниеОбъектов.Добавить(ОписаниеОбъекта);

	КонецЦикла;

	Возврат ОписаниеОбъектов;

КонецФункции

Функция ОбъектИсключенИзЗаполнения(ВидМетаданных, ИмяОбъекта)

	Ключ = ВидМетаданных + "." + ИмяОбъекта;
	Возврат Ключ = "РегистрыСведений.СоответствияОбъектовИнформационныхБаз"
		Или Ключ = "Справочники.Пользователи";

КонецФункции

// Возвращает имя реквизита объекта метаданных, содержащего ссылку на организацию.
// По этому реквизиту движок синхронизации ограничивает выборку данными организации базы.
//
// Параметры:
//  ОбъектМетаданных - ОбъектМетаданных - объект метаданных из состава плана обмена;
//  ВидМетаданных    - Строка - имя вида метаданных во множественном числе.
//
// Возвращаемое значение:
//  Строка - имя реквизита, например "Организация"; пустая строка, если реквизит не найден.
//
Функция ПолеОрганизацииОбъектаМетаданных(ОбъектМетаданных, ВидМетаданных)

	Если ВидМетаданных = "Справочники" Или ВидМетаданных = "Документы" Тогда
		Реквизиты = ОбъектМетаданных.Реквизиты;
	ИначеЕсли ВидМетаданных = "РегистрыСведений" Тогда
		Реквизиты = ОбъектМетаданных.Измерения;
	Иначе
		Возврат "";
	КонецЕсли;

	Реквизит = Реквизиты.Найти("Организация");
	Если Реквизит <> Неопределено Тогда
		Возврат "Организация";
	КонецЕсли;

	Возврат "";

КонецФункции
#КонецОбласти 

#Область HTTPИнтеграция
// Отправляет POST-запрос в базу-приемник и возвращает разобранное тело ответа.
//
// Параметры:
//  ДанныеБазы - Структура - данные базы, см. КонструкторСтруктурыДанныеБазы;
//  ИмяКоманды - Строка - имя метода, зарезервировано для совместимости;
//  ДанныеЗапроса - Структура - тело запроса, сериализуется в JSON;
//  ПутьНаСервере - Строка - путь запроса. Если не заполнен, используется метод Обороты.
//
// Возвращаемое значение:
//  Произвольный - разобранное тело ответа базы-приемника.
//
 Функция ЗапросКБазеПриемнику(ДанныеБазы, ИмяКоманды, ДанныеЗапроса, ПутьНаСервере)
	 База = ДанныеБазы.База;
	 Если Не ЗначениеЗаполнено(ПутьНаСервере) Тогда
		 ПутьНаСервере = База.WSИмяБазы + "/hs/sverka/V1/Обороты";
	 КонецЕсли;
	 //Соединение = ПолучитьПодключениеHTTPСервер(База);
	 
	 Заголовки = Новый Соответствие;
	 Заголовки.Вставить("Content-Type", "application/json;charset=UTF-8");
	 
	 Запрос = Новый HTTPЗапрос(ПутьНаСервере, Заголовки);
	 Запрос.УстановитьТелоИзСтроки(JSON(ДанныеЗапроса, Ложь), "UTF-8", ИспользованиеByteOrderMark.НеИспользовать);   
	 
	 Ответ = ДанныеБазы.Соединение.ОтправитьДляОбработки(Запрос);	
	 Если Ответ.КодСостояния = 200 Тогда
		 
		 ТекстОтвета = Ответ.ПолучитьТелоКакСтроку();
		 
		 Попытка
			 ДанныеОтвета = unJSON(ТекстОтвета);
		 Исключение        
			 Коммментарий = СтрШаблон("Ошибка получения структуры из json. Причина: %1%2Данные ответа: %3", 
			 	ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()), Символы.ПС, ДанныеОтвета);
			 ЗаписьЖурналаРегистрации(НСтр("ru = 'Проверка синхронизации данных. Разбор JSON'", ОбщегоНазначения.КодОсновногоЯзыка()),
			 УровеньЖурналаРегистрации.Ошибка, , База.Ссылка, Коммментарий); 
			 ВызватьИсключение;
		 КонецПопытки;
		 
		 Возврат ДанныеОтвета;
		 
	 ИначеЕсли Ответ.КодСостояния = 302 или Ответ.КодСостояния = 301 Тогда 
		 НовыйАдрес = Ответ.Заголовки.Получить("Location"); 
	 Иначе        
		 Коммментарий = СтрШаблон("Не удалось выполнить запрос веб-сервиса. Код ответа: %1", Ответ.КодСостояния);
		 ЗаписьЖурналаРегистрации(НСтр("ru = 'Проверка синхронизации данных. Код состояния'", ОбщегоНазначения.КодОсновногоЯзыка()),
		 УровеньЖурналаРегистрации.Ошибка, , База.Ссылка, Коммментарий);   
		ВызватьИсключение("Не удалось выполнить запрос веб-сервиса.");
	 КонецЕсли;
	 
КонецФункции

// Создает таблицу результатов регистрации объектов к обмену.
//
// Возвращаемое значение:
//  ТаблицаЗначений - колонки ПолноеИмяМетаданных, УникальныйИдентификатор, Результат.
//
Функция ТаблицаРезультатаРегистрации()

	ТаблицаРезультата = Новый ТаблицаЗначений;
	ТаблицаРезультата.Колонки.Добавить("ПолноеИмяМетаданных", Новый ОписаниеТипов("Строка"));
	ТаблицаРезультата.Колонки.Добавить("УникальныйИдентификатор", Новый ОписаниеТипов("Строка"));
	ТаблицаРезультата.Колонки.Добавить("Результат", Новый ОписаниеТипов("Строка"));

	Возврат ТаблицаРезультата;

КонецФункции

// Добавляет строку в таблицу результатов регистрации.
//
// Параметры:
//  ТаблицаРезультата - ТаблицаЗначений - таблица результатов;
//  ПолноеИмяМетаданных - Строка - полное имя объекта метаданных;
//  УникальныйИдентификатор - Строка - ГУИД объекта;
//  Результат - Строка - текст результата.
//
Процедура ДобавитьРезультатРегистрации(ТаблицаРезультата, ПолноеИмяМетаданных, УникальныйИдентификатор, Результат)

	СтрокаРезультата = ТаблицаРезультата.Добавить();
	СтрокаРезультата.ПолноеИмяМетаданных = ПолноеИмяМетаданных;
	СтрокаРезультата.УникальныйИдентификатор = УникальныйИдентификатор;
	СтрокаРезультата.Результат = Результат;

КонецПроцедуры

// Возвращает параметры базы из списка актуальных баз.
//
// Параметры:
//  База - СправочникСсылка.EMS_ПараметрыБаз - ссылка на параметры базы.
//
// Возвращаемое значение:
//  Структура, Неопределено - параметры базы или Неопределено, если база не найдена.
//
Функция ПараметрыБазыПоСсылке(База)

	Для Каждого ПараметрыБазы Из БазыДляСинхронизации() Цикл
		Если ПараметрыБазы.Ссылка = База Тогда
			Возврат ПараметрыБазы;
		КонецЕсли;
	КонецЦикла;

	Возврат Неопределено;

КонецФункции

// Заполняет пакет регистрации по сообщениям синхронизации выбранной базы.
//
// Параметры:
//  База - СправочникСсылка.EMS_ПараметрыБаз - база, по которой берутся расхождения;
//  ЭлементыПакета - Массив из Структура - заполняемый массив элементов пакета для HTTP-запроса;
//  ОписанияЭлементов - Массив из Структура - заполняемый массив описаний элементов, позиция совпадает с ЭлементыПакета;
//  ТаблицаРезультата - ТаблицаЗначений - таблица результатов, в которую пишутся ошибки разбора.
//
Процедура ЗаполнитьПакетРегистрации(База, ЭлементыПакета, ОписанияЭлементов, ТаблицаРезультата)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Сообщения.Тип КАК Тип,
		|	Сообщения.Вид КАК Вид,
		|	Сообщения.Сообщение КАК Сообщение
		|ИЗ
		|	РегистрСведений.EMS_СообщенияСинхронизации КАК Сообщения
		|ГДЕ
		|	Сообщения.База = &База
		|	И Сообщения.Сообщение ПОДОБНО ""%<Объект не найден>%""";
	Запрос.УстановитьПараметр("База", База);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл

		ВидДанных = ВидДанныхДляРегистрации(Выборка.Тип);
		Если ВидДанных = "" Тогда
			ДобавитьРезультатРегистрации(ТаблицаРезультата, ИмяОбъектаМетаданных(Выборка.Тип, Выборка.Вид), "",
				"Неподдерживаемый тип метаданных для регистрации");
			Продолжить;
		КонецЕсли;

		ГУИДы = ГУИДыИзСообщения(Выборка.Сообщение);
		Если ГУИДы.Количество() = 0 Тогда
			ДобавитьРезультатРегистрации(ТаблицаРезультата, ИмяОбъектаМетаданных(Выборка.Тип, Выборка.Вид), "",
				"В сообщении не найден ГУИД объекта");
			Продолжить;
		КонецЕсли;

		ПолноеИмяМетаданных = ИмяОбъектаМетаданных(Выборка.Тип, Выборка.Вид);
		Для Каждого ГУИД Из ГУИДы Цикл

			ЭлементПакета = Новый Структура;
			ЭлементПакета.Вставить("ПолноеИмяМетаданных", ПолноеИмяМетаданных);
			ЭлементПакета.Вставить("ВидДанныхДляРегистрации", ВидДанных);
			ЭлементПакета.Вставить("КлючРегистрацииОтбор", КлючРегистрацииОтбор(ГУИД));
			ЭлементыПакета.Добавить(ЭлементПакета);

			ОписанияЭлементов.Добавить(Новый Структура(
				"ПолноеИмяМетаданных, УникальныйИдентификатор", ПолноеИмяМетаданных, ГУИД));

		КонецЦикла;

	КонецЦикла;

КонецПроцедуры

// Возвращает вид данных для регистрации по типу объекта метаданных.
//
// Параметры:
//  Тип - Строка - имя коллекции метаданных, например "Справочники".
//
// Возвращаемое значение:
//  Строка - вид данных для регистрации или пустая строка, если тип не поддержан.
//
Функция ВидДанныхДляРегистрации(Тип)

	Если Тип = "Справочники" Тогда
		Возврат "Catalog";
	ИначеЕсли Тип = "Документы" Тогда
		Возврат "Document";
	ИначеЕсли Тип = "ПланыВидовХарактеристик" Тогда
		Возврат "ChartOfCharacteristicTypes";
	КонецЕсли;

	Возврат "";

КонецФункции

// Возвращает полное имя объекта метаданных по типу и виду.
//
// Параметры:
//  Тип - Строка - имя коллекции метаданных, например "Справочники";
//  Вид - Строка - имя объекта метаданных, например "ФизическиеЛица".
//
// Возвращаемое значение:
//  Строка - полное имя объекта метаданных, например "Справочник.ФизическиеЛица".
//
Функция ИмяОбъектаМетаданных(Тип, Вид)

	Если Тип = "Справочники" Тогда
		Возврат "Справочник." + Вид;
	ИначеЕсли Тип = "Документы" Тогда
		Возврат "Документ." + Вид;
	ИначеЕсли Тип = "ПланыВидовХарактеристик" Тогда
		Возврат "ПланВидовХарактеристик." + Вид;
	КонецЕсли;

	Возврат Тип + "." + Вид;

КонецФункции

// Извлекает ГУИДы объектов из текста сообщения вида "<Объект не найден> (702:8049...)".
//
// Параметры:
//  ТекстСообщения - Строка - текст сообщения регистра EMS_СообщенияСинхронизации.
//
// Возвращаемое значение:
//  Массив из Строка - найденные ГУИД в формате xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx.
//
Функция ГУИДыИзСообщения(ТекстСообщения)

	Результат = Новый Массив;
	Совпадения = СтрНайтиВсеПоРегулярномуВыражению(ТекстСообщения, "<Объект не найден> \([^)]*\)");
	Если Совпадения = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;

	Для Каждого Совпадение Из Совпадения Цикл
		Фрагмент = Сред(ТекстСообщения, Совпадение.НачальнаяПозиция, Совпадение.Длина);
		ГУИД = ГУИДИзФрагмента(Фрагмент);
		Если ЗначениеЗаполнено(ГУИД) Тогда
			Результат.Добавить(ГУИД);
		КонецЕсли;
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Преобразует фрагмент "<Объект не найден> (702:8049...)" в строку ГУИД.
//
// Параметры:
//  Фрагмент - Строка - найденный фрагмент сообщения.
//
// Возвращаемое значение:
//  Строка - ГУИД или пустая строка, если преобразовать не удалось.
//
Функция ГУИДИзФрагмента(Фрагмент)

	Внутреннее = СтрЗаменить(Фрагмент, "<Объект не найден> (", "");
	Внутреннее = СтрЗаменить(Внутреннее, ")", "");
	Внутреннее = СтрЗаменить(Внутреннее, "0x", "");

	Части = СтрРазделить(Внутреннее, ":", Ложь);
	Если Части.Количество() < 2 Тогда
		Возврат "";
	КонецЕсли;

	Представление = СокрЛП(Части[1]);
	Если СтрДлина(Представление) <> 32 Тогда
		Возврат "";
	КонецЕсли;

	ГУИД = Сред(Представление, 25, 8) + "-" + Сред(Представление, 21, 4) + "-"
		+ Сред(Представление, 17, 4) + "-" + Сред(Представление, 1, 4) + "-"
		+ Сред(Представление, 5, 12);

	Попытка
		Идентификатор = Новый УникальныйИдентификатор(ГУИД);
	Исключение
		Возврат "";
	КонецПопытки;

	Возврат Строка(Идентификатор);

КонецФункции

Функция РазобратьФрагментОбъектНеНайден(Фрагмент)

	Внутреннее = СтрЗаменить(Фрагмент, "<Объект не найден> (", "");
	Если Прав(Внутреннее, 1) = ")" Тогда
		Внутреннее = Лев(Внутреннее, СтрДлина(Внутреннее) - 1);
	КонецЕсли;

	Позиция = СтрНайти(Внутреннее, ":");
	Если Позиция = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;

	КодТипа = СтрЗаменить(СокрЛП(Лев(Внутреннее, Позиция - 1)), "0x", "");
	ГУИД = ГУИДИзФрагмента(Фрагмент);
	Если Не ЗначениеЗаполнено(ГУИД) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Возврат Новый Структура("КодТипа, ГУИД", КодТипа, ГУИД);

КонецФункции

Функция КодыТиповСсылок()

	КодыТипов = Новый Соответствие;
	ДобавитьКодыТиповКоллекции(КодыТипов, Метаданные.Справочники, "Справочник");
	ДобавитьКодыТиповКоллекции(КодыТипов, Метаданные.Документы, "Документ");
	ДобавитьКодыТиповКоллекции(КодыТипов, Метаданные.ПланыВидовХарактеристик, "ПланВидовХарактеристик");
	ДобавитьКодыТиповКоллекции(КодыТипов, Метаданные.ПланыСчетов, "ПланСчетов");
	ДобавитьКодыТиповКоллекции(КодыТипов, Метаданные.ПланыВидовРасчета, "ПланВидовРасчета");
	ДобавитьКодыТиповКоллекции(КодыТипов, Метаданные.ПланыОбмена, "ПланОбмена");
	ДобавитьКодыТиповКоллекции(КодыТипов, Метаданные.БизнесПроцессы, "БизнесПроцесс");
	ДобавитьКодыТиповКоллекции(КодыТипов, Метаданные.Задачи, "Задача");
	ДобавитьКодыТиповКоллекции(КодыТипов, Метаданные.Перечисления, "Перечисление");
	Возврат КодыТипов;

КонецФункции

Процедура ДобавитьКодыТиповКоллекции(КодыТипов, Коллекция, Вид)

	Для Каждого ОбъектМетаданных Из Коллекция Цикл

		ПустаяСсылка = ПустаяСсылкаМенеджера(Вид, ОбъектМетаданных.Имя);
		Если ПустаяСсылка = Неопределено Тогда
			Продолжить;
		КонецЕсли;

		Смв = "";
		Тип = "";
		Код = "";
		УИД = "";
		СтрокаВнутрАнализ(ЗначениеВСтрокуВнутр(ПустаяСсылка), Смв, Тип, Код, УИД);
		Если Не ЗначениеЗаполнено(Код) Тогда
			Продолжить;
		КонецЕсли;

		КодыТипов.Вставить(Код, ОбъектМетаданных.ПолноеИмя());
		Попытка
			КодыТипов.Вставить(Формат(Число(Код), "ЧГ=0"), ОбъектМетаданных.ПолноеИмя());
		Исключение
		КонецПопытки;

	КонецЦикла;

КонецПроцедуры

Функция ПустаяСсылкаМенеджера(Вид, Имя)

	Если Вид = "Справочник" Тогда
		Возврат Справочники[Имя].ПустаяСсылка();
	ИначеЕсли Вид = "Документ" Тогда
		Возврат Документы[Имя].ПустаяСсылка();
	ИначеЕсли Вид = "ПланВидовХарактеристик" Тогда
		Возврат ПланыВидовХарактеристик[Имя].ПустаяСсылка();
	ИначеЕсли Вид = "ПланСчетов" Тогда
		Возврат ПланыСчетов[Имя].ПустаяСсылка();
	ИначеЕсли Вид = "ПланВидовРасчета" Тогда
		Возврат ПланыВидовРасчета[Имя].ПустаяСсылка();
	ИначеЕсли Вид = "ПланОбмена" Тогда
		Возврат ПланыОбмена[Имя].ПустаяСсылка();
	ИначеЕсли Вид = "БизнесПроцесс" Тогда
		Возврат БизнесПроцессы[Имя].ПустаяСсылка();
	ИначеЕсли Вид = "Задача" Тогда
		Возврат Задачи[Имя].ПустаяСсылка();
	ИначеЕсли Вид = "Перечисление" Тогда
		Возврат Перечисления[Имя].ПустаяСсылка();
	КонецЕсли;

	Возврат Неопределено;

КонецФункции

Функция ВидМетаданныхДляОтчета(ПолноеИмя)

	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(ПолноеИмя);
	Если ОбъектМетаданных = Неопределено Тогда
		Возврат ПолноеИмя;
	КонецЕсли;

	Синоним = ОбъектМетаданных.Представление();
	Если Не ЗначениеЗаполнено(Синоним) Тогда
		Возврат ПолноеИмя;
	КонецЕсли;

	Возврат Синоним + " (" + ПолноеИмя + ")";

КонецФункции

Процедура ЗаполнитьПредставленияИзНижнейБазы(База, ЭлементыЗапроса, ФрагментыЗапроса, Описания)

	Если ЭлементыЗапроса.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ПараметрыБазы = ПараметрыБазыПоСсылке(База);
	Если ПараметрыБазы = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ДанныеБазы = КонструкторСтруктурыДанныеБазы();
	ДанныеБазы.База = ПараметрыБазы;
	ДанныеБазы.Соединение = ПолучитьПодключениеHTTPСервер(ПараметрыБазы);
	Если ДанныеБазы.Соединение = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Попытка
		Ответ = ЗапросКБазеПриемнику(
			ДанныеБазы,
			"Представления",
			Новый Структура("Элементы", ЭлементыЗапроса),
			ПараметрыБазы.WSИмяБазы + "/hs/sverka/V1/Представления");
	Исключение
		Возврат;
	КонецПопытки;

	Если ТипЗнч(Ответ) <> Тип("Массив") Тогда
		Возврат;
	КонецЕсли;

	Для Каждого СтрокаОтвета Из Ответ Цикл

		Индекс = Неопределено;
		Представление = "";
		Если ТипЗнч(СтрокаОтвета) = Тип("Структура") Тогда
			СтрокаОтвета.Свойство("Индекс", Индекс);
			СтрокаОтвета.Свойство("Представление", Представление);
		ИначеЕсли ТипЗнч(СтрокаОтвета) = Тип("Соответствие") Тогда
			Индекс = СтрокаОтвета.Получить("Индекс");
			Представление = СтрокаОтвета.Получить("Представление");
		Иначе
			Продолжить;
		КонецЕсли;

		Если ТипЗнч(Индекс) <> Тип("Число")
			Или Индекс < 0
			Или Индекс >= ФрагментыЗапроса.Количество() Тогда
			Продолжить;
		КонецЕсли;

		Описания[ФрагментыЗапроса[Индекс]].Представление = Строка(Представление);

	КонецЦикла;

КонецПроцедуры

// Формирует JSON-строку отбора для регистрации объекта по ГУИД.
//
// Параметры:
//  ГУИД - Строка - идентификатор объекта в формате xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx.
//
// Возвращаемое значение:
//  Строка - JSON вида {"УникальныйИдентификатор":"..."}.
//
Функция КлючРегистрацииОтбор(ГУИД)

	Возврат JSON(Новый Структура("УникальныйИдентификатор", ГУИД), Ложь);

КонецФункции

// Переносит результаты регистрации из ответа базы-источника в таблицу результатов.
//
// Параметры:
//  Ответ - Произвольный - разобранное тело ответа базы-источника;
//  ОписанияЭлементов - Массив из Структура - описания отправленных элементов пакета;
//  ТаблицаРезультата - ТаблицаЗначений - заполняемая таблица результатов.
//
Процедура РазобратьРезультатРегистрации(Ответ, ОписанияЭлементов, ТаблицаРезультата)

	Если ТипЗнч(Ответ) <> Тип("Массив") Тогда
		ДобавитьРезультатРегистрации(ТаблицаРезультата, "", "",
			"База-источник вернула неожиданный ответ регистрации.");
		Возврат;
	КонецЕсли;

	Для Каждого СтрокаОтвета Из Ответ Цикл

		Индекс = СтрокаОтвета.Индекс;
		Описание = Неопределено;
		Если ТипЗнч(Индекс) = Тип("Число")
			И Индекс >= 0
			И Индекс < ОписанияЭлементов.Количество() Тогда
			Описание = ОписанияЭлементов[Индекс];
		КонецЕсли;
		Если Описание = Неопределено Тогда
			Продолжить;
		КонецЕсли;

		РезультатРегистрации = "Зарегистрирован";
		Если Не СтрокаОтвета.Success Тогда
			РезультатРегистрации = СтрокаОтвета.ErrorText;
		КонецЕсли;

		ДобавитьРезультатРегистрации(ТаблицаРезультата, Описание.ПолноеИмяМетаданных,
			Описание.УникальныйИдентификатор, РезультатРегистрации);

	КонецЦикла;

КонецПроцедуры

Функция JSON(Данные, СОтступами = Истина)
	
	ЗаписьJSON = Новый ЗаписьJSON;
	Если СОтступами Тогда
		ПараметрыJSON = Новый ПараметрыЗаписиJSON(, "	");
	Иначе
		ПараметрыJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет);
	КонецЕсли;
	ЗаписьJSON.УстановитьСтроку(ПараметрыJSON);
	ЗаписатьJSON(ЗаписьJSON, Данные);
	Результат = ЗаписьJSON.Закрыть();
	
	Возврат Результат;
	
КонецФункции

Функция unJSON(JSONСтрока)
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(JSONСтрока);
	Результат = ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();
	
	Возврат Результат;
	
КонецФункции

// Создает HTTP-соединение с базой-приемником.
//
// Параметры:
//  База - Структура - параметры базы (см. КонструкторСтруктурыБазыДляСинхронизации).
//
// Возвращаемое значение:
//  HTTPСоединение, Неопределено - соединение с базой или Неопределено, если создать соединение не удалось.
//
Функция ПолучитьПодключениеHTTPСервер(База)  

	Попытка
		ЗначениеSSL = НРег(СокрЛП(База.SSL));
		ИспользоватьSSL = ЗначениеSSL <> ""
			И ЗначениеSSL <> "нет" И ЗначениеSSL <> "no"
			И ЗначениеSSL <> "false" И ЗначениеSSL <> "0";

		ЗащищенноеСоединение = Неопределено;
		Если ИспользоватьSSL Тогда
			ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL(Неопределено, Неопределено);
		КонецЕсли;

		Соединение = Новый HTTPСоединение(База.WSИмяСервера, , База.WSИмяПользователя, База.WSПароль, , , ЗащищенноеСоединение);	
	Исключение 
		Коммментарий = СтрШаблон("Ошибка получения http соединения с базой. Причина: %1", ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Проверка синхронизации данных. ПолучитьПодключениеHTTPСервер'", ОбщегоНазначения.КодОсновногоЯзыка()),
		УровеньЖурналаРегистрации.Ошибка, , База.Ссылка, Коммментарий);  
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат Соединение;
	
КонецФункции
#КонецОбласти  

#Область ПреобразованияСтрок
 	
Функция СтрокаПустогоЗначения(Знач Тип) 
	Возврат ЗначениеВСтрокуВнутр(ПустоеЗначение(Тип));
КонецФункции

Функция ПустоеЗначение(Знач Тип) 
	Если Тип =  "DocumentRef.Трансляция" или Тип = "DocumentRef.ТрансформационнаяКорректировка" Тогда
	 	Возврат Неопределено;
	КонецЕсли;
	
	Если ТипЗнч(Тип) = Тип("Строка") Тогда
		ТипСтр = Тип;
		Тип = Тип(Тип);
	Иначе 
		ТипСтр = XMLТип(Тип).ИмяТипа;
	КонецЕсли;
	
	ТипСтр = СтрРазделить(ТипСтр, ".")[0];
	
	Если      ТипСтр = "EnumRef" Тогда
		Возврат XMLЗначение(Тип, "");
	Иначе
		Возврат XMLЗначение(Тип, "00000000-0000-0000-0000-000000000000");
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

Процедура СтрокаВнутрАнализ(СтрВн, Смв = "", Тип = "", Код = "", УИД = "")
	Смв = ""; Тип = ""; Код = ""; УИД = "";
	
	мСтр = СтрРазделить(Сред(СтрВн, 2, СтрДлина(СтрВн) - 2), ",", Истина);
	КолВо = мСтр.Количество();
	
	Смв = Сред(мСтр[0], 2, 1);
	
	Если КолВо < 2 Тогда
		Возврат;
	КонецЕсли;
	
	Тип = мСтр[1];
	
	Если КолВо < 3 Тогда
		Возврат;
	КонецЕсли;
	
	мКодУИД = СтрРазделить(мСтр[2], ":", Истина);
	Код = мКодУИД[0];
	УИД = мКодУИД[1];
КонецПроцедуры

Функция СтрокаВнутрСинтез(Смв, Тип, Код, УИД)
	Возврат "{"
		+ """" + Смв + """" + ","
		+ Тип + ","
		+ Код + ":"
		+ УИД
		+ "}"
	;
КонецФункции

Функция СтрТипЗнч(ЗнчСтр) 
	Знч = ЗначениеИзСтрокиВнутр(ЗнчСтр);
	Тип = ТипЗнч(Знч);
	Возврат XMLТип(Тип).ИмяТипа;
КонецФункции
#КонецОбласти 

#Область АдаптацияДанных
Функция АдаптироватьHTTP(Знач Зн, НаружуИстинаВнутрьЛожь, СоответствияОбъектов, Типы, мТипы)
	Тип = ТипЗнч(Зн);
	Если      Тип = Тип("Структура") Тогда
		Рез = Новый Структура;
		Для Каждого Стр Из Зн Цикл
			Рез.Вставить(Стр.Ключ, АдаптироватьHTTP(Стр.Значение, НаружуИстинаВнутрьЛожь, СоответствияОбъектов, Типы, мТипы));
		КонецЦикла;
		
	ИначеЕсли Тип = Тип("Массив") Тогда
		Рез = Новый Массив;
		Для Каждого Стр Из Зн Цикл
			Рез.Добавить(АдаптироватьHTTP(Стр, НаружуИстинаВнутрьЛожь, СоответствияОбъектов, Типы, мТипы));
		КонецЦикла;
		
	Иначе
		Рез = Зн;
		
		Если НаружуИстинаВнутрьЛожь = Ложь И СоответствияОбъектов <> Неопределено Тогда
			Соо = СоответствияОбъектов.Получить(Рез);
			Если Соо <> Неопределено Тогда
				Рез = Соо;
			КонецЕсли;
		КонецЕсли;
		
		
		Смв = ""; ТипУИД = ""; КодУИД = ""; УИД = "";
		СтрокаВнутрАнализ(Рез, Смв, ТипУИД, КодУИД, УИД);
		
		Если Смв = "#" И УИД <> "" Тогда 
			Пустое = Типы.Получить(ТипУИД);
			Если Пустое = Неопределено Тогда
				Если НаружуИстинаВнутрьЛожь = Истина Тогда 
					ТипСтр = СтрТипЗнч(Рез);
				Иначе
					тТипСтр = мТипы.Получить(ТипУИД); 
					Пустое = СтрокаПустогоЗначения(тТипСтр);
				КонецЕсли;
				Типы.Вставить(ТипУИД, Пустое);
			КонецЕсли;
			
			СтрокаВнутрАнализ(Пустое,, ТипУИД, КодУИД, );
			
			Рез = СтрокаВнутрСинтез(Смв, ТипУИД, КодУИД, УИД);
		КонецЕсли;
	КонецЕсли;
	Возврат Рез;
КонецФункции

Функция СтуктураВИзСтрокиВнутр(Зн, ВИстинаИзЛожь)
	Тип = ТипЗнч(Зн);
	Если      Тип = Тип("Структура") Тогда
		Рез = Новый Структура;
		Для Каждого Стр Из Зн Цикл
			Рез.Вставить(Стр.Ключ, СтуктураВИзСтрокиВнутр(Стр.Значение, ВИстинаИзЛожь));
		КонецЦикла;
	ИначеЕсли Тип = Тип("Массив") Тогда
		Рез = Новый Массив;
		Для Каждого Стр Из Зн Цикл
			Рез.Добавить(СтуктураВИзСтрокиВнутр(Стр, ВИстинаИзЛожь));
		КонецЦикла;
	Иначе
		Рез = ?(ВИстинаИзЛожь, ЗначениеВСтрокуВнутр(Зн), ЗначениеИзСтрокиВнутр(Зн));
	КонецЕсли;
	Возврат Рез;
КонецФункции  

Функция СтуктураВИзСтрокиВнутрНорм(Зн)
		Рез = Новый Массив;
		Для Каждого Стр Из Зн Цикл
			Для Каждого мСтр Из Стр Цикл
				Если мСтр = "{""B"",0}" Тогда
					Продолжить;	
				КонецЕсли;
				Рез.Добавить(ЗначениеИзСтрокиВнутр(мСтр));	
			КонецЦикла;
			
		КонецЦикла;
	Возврат Рез;
КонецФункции

#КонецОбласти

#Область СравнениеКлючей
 
Функция ПолучитьРазницуПоКлючам(соЛокал, соВнешн, Индекс, ДанныеБазы, ОбъектМетаданных, НаборЗаписейСообщений)
	Если ДанныеБазы.Отладка Тогда
		Сообщить("Л " + соЛокал.Количество() + ", В " + соВнешн.Количество()); 
	КонецЕсли;
	соРазница = Новый Соответствие;
	мРазница = Новый Соответствие;  
	мКлючЗаписиРС = Новый Массив;
		Для Каждого Стр Из соВнешн Цикл
			Если соЛокал.Получить(Стр.Ключ) = Неопределено Тогда
				мСтр = Стр.Значение;
				СтрокаНабора = НаборЗаписейСообщений.Добавить();
				СтрокаНабора.НомерЗаписи = НаборЗаписейСообщений.Количество();
				СтрокаНабора.Дата = ТекущаяДатаСеанса();
				СтрокаНабора.База = ДанныеБазы.База.Ссылка;
				СтрокаНабора.Вид = ОбъектМетаданных.Вид;
				СтрокаНабора.Тип = ОбъектМетаданных.Тип;
				СтрокаНабора.Сообщение = СообщитьМассивСтрокуЗн(мСтр, "В<Л", ДанныеБазы.Отладка);
				Если Индекс = Неопределено Тогда
				  мКлючЗаписиРС.Добавить(Стр.Значение);      
				Иначе 
				соРазница.Вставить(мСтр[Индекс]);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;

	Рез = Новый Массив;
	Для Каждого Стр Из соРазница Цикл
		мСтр = Новый Массив;
		мСтр.Добавить(Стр.Ключ);
		Рез.Добавить(мСтр);
	КонецЦикла; 
	
	Если мКлючЗаписиРС.Количество()>0   Тогда
		 Возврат мКлючЗаписиРС;
	КонецЕсли;
	Если ДанныеБазы.Отладка Тогда
		Сообщить("Разниц: " + Рез.Количество());
	КонецЕсли;
	
	Возврат Рез;
КонецФункции

Функция СообщитьМассивСтрокуЗн(Знач мСтр, Пре, Отладка)
	Сооб = "";
	Сооб = Пре + "|";
	Для Каждого Стр Из мСтр Цикл
		Зн = ЗначениеИзСтрокиВнутр(Стр);
				
		Сооб = Сооб
			+ Зн  + ","
			+ "|"
		;
	КонецЦикла;  
	Если Отладка Тогда
		Сообщить(Сооб);
	КонецЕсли;
	Возврат Сооб;
КонецФункции

Функция ПолучитьКлючиСтр(Внешн, ИнС = Неопределено) 
	соВнешн = Новый Соответствие;
	Для Каждого Стр Из Внешн Цикл
		Ключ = "";   
		сч = 0;
		Для Каждого Зн Из Стр Цикл  
			Если  ИнС = сч Тогда
				Продолжить;	
			КонецЕсли;
			
			Ключ = Ключ + Зн + ","; 
			сч = сч +1;
		КонецЦикла;
		
		соВнешн.Вставить(Ключ, Стр);
	КонецЦикла;
	
	Возврат соВнешн;
КонецФункции
#КонецОбласти    

#Область МетаданныеЗапросы
 
Функция ОбъектыВыборкаОтбор(ОбъектМетаданных) 
	
	Рез = Новый Структура("Тип, Вид", ОбъектМетаданных.Тип, ОбъектМетаданных.Вид);
	
	Если ОбъектМетаданных.Тип = "Справочники" Тогда
		ТипЗапрос = "Справочник";
	ИначеЕсли ОбъектМетаданных.Тип = "Документы" Тогда
		ТипЗапрос = "Документ";
	ИначеЕсли ОбъектМетаданных.Тип = "РегистрыСведений" Тогда
		ТипЗапрос = "РегистрСведений";
	ИначеЕсли ОбъектМетаданных.Тип = "РегистрыНакопления" Тогда
		ТипЗапрос = "РегистрНакопления";
	ИначеЕсли ОбъектМетаданных.Тип = "ПланыВидовХарактеристик" Тогда
		ТипЗапрос = "ПланВидовХарактеристик";
	ИначеЕсли ОбъектМетаданных.Тип = "Последовательности" Тогда
		ТипЗапрос = "Последовательность";
	КонецЕсли;
	
	мИзмерения = МДИзмерения(ОбъектМетаданных.Тип, ОбъектМетаданных.Вид);
	Рез.Вставить("Поля", мИзмерения);
	
	ЗапросТекст = 
		"ВЫБРАТЬ 
		|	" + ?(мИзмерения.Количество() = 0, "1 КАК ПолеВыборки", СтрСоединить(мИзмерения, ", ")) + "
		|ИЗ
		|	" + ТипЗапрос + "." + ОбъектМетаданных.Вид + "
		|";
	
	ЗапросПараметры = Новый Структура;
	ЗапросТекст = ЗапросТекст + ЗапросУсловие(ОбъектМетаданных);
	
	Рез.Вставить("мИзмерения", мИзмерения);
	Рез.Вставить("ЗапросТекст", ЗапросТекст);
	Возврат Рез;
КонецФункции    

Функция МДИзмерения(Тип, Вид, ВыборкаПроведенные = Ложь, ПометкаУдаления = Истина)

	мИзмерения = Новый Массив;
	
	Если      Тип = "Константы" Тогда
	ИначеЕсли Тип = "Справочники" Или Тип = "Документы" Или Тип = "ПланыВидовХарактеристик" Тогда
		
		мИзмерения.Добавить("Ссылка");
		
		Если Тип = "Документы"  Тогда
			Если  ВыборкаПроведенные Тогда
			КонецЕсли;
		КонецЕсли;
		
		Если Тип = "Справочники" Тогда 
		КонецЕсли;
		
	ИначеЕсли Тип = "РегистрыСведений" Тогда
			МД = Метаданные[Тип][Вид];
			Независимый = Метаданные.СвойстваОбъектов.РежимЗаписиРегистра.Независимый;
			Непериодический = Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Непериодический;
		
		Для Каждого ТекИзм Из МД.Измерения Цикл
			Если Тип = "РегистрыСведений" И Не ТекИзм.ОсновнойОтбор Тогда
				Продолжить;
			КонецЕсли;
			мИзмерения.Добавить(ТекИзм.Имя);
		КонецЦикла;
		
		Если Не МД.РежимЗаписи = Независимый Тогда
			мИзмерения.Добавить("Регистратор");
		КонецЕсли;
		Если МД.ПериодичностьРегистраСведений <> Непериодический Тогда
			мИзмерения.Добавить("Период");
		КонецЕсли;

		Если мИзмерения.Количество() = 0 Тогда
			Для Каждого ТекИзм Из МД.Измерения Цикл
				мИзмерения.Добавить(ТекИзм.Имя);
			КонецЦикла;
		КонецЕсли;
		
	ИначеЕсли Тип = "РегистрыНакопления" Тогда
		мИзмерения.Добавить("Регистратор");
		
	ИначеЕсли Тип = "Последовательности" Тогда
		мИзмерения.Добавить("Организация"); 
		мИзмерения.Добавить("Регистратор");
		мИзмерения.Добавить("Период");
		мИзмерения.Добавить("МоментВремени");
		мИзмерения.Добавить("СостояниеПроведения");
		
	КонецЕсли;

	Возврат мИзмерения;
КонецФункции

Функция ЗапросУсловие(ОбъектМетаданных)
	мУсловие = Новый Массив;	
	Если ЗначениеЗаполнено(ОбъектМетаданных.ПолеОрганизации) Тогда
		 мУсловие.Добавить(СтрШаблон("%1 = &Организация", ОбъектМетаданных.ПолеОрганизации));
	КонецЕсли;	
	Если мУсловие.Количество() = 0 Тогда
		Возврат "";
	КонецЕсли;
	Возврат " "
			+ "ГДЕ" + Символы.ПС
			+ СтрСоединить(мУсловие, Символы.ПС + "И ")
			+ Символы.ПС;
КонецФункции

Функция ПолучитьШаблонЗапроса(СчетКод, ВариантаШаблона)
	
	Шаблон = "ВЫБРАТЬ
	|	Начисления.Регистратор КАК Регистратор,
	|	Начисления.Сотрудник КАК Сотрудник,
	|	Начисления.ФизическоеЛицо КАК ФизическоеЛицо,
	|	Начисления.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	Начисления.СторноТекущегоПериода КАК СторноТекущегоПериода,
	|	Начисления.Результат КАК Результат
	|ИЗ
	|	РегистрРасчета.Начисления КАК Начисления
	|	&Условие";
	Возврат Шаблон; 
	
КонецФункции
#КонецОбласти

#Область ОбработкаВыборок
  Процедура МассивИзВыборки(Выб, ДанныеБазы, ИзВнутр = Истина)

	Кол = Выб.Поля.Количество();
	Тип = Выб.Тип; Вид = Выб.Вид;
	Измерения = Выб.Поля;
	сИзмерения = СтрСоединить(Измерения, ",");
	Отбор = Новый Структура(сИзмерения);
	
	Поля = Новый Соответствие; Сч = 0;
	Для Каждого Поле Из Поля Цикл
		Поля.Вставить(Поле, Сч);
		Сч = Сч + 1;
	КонецЦикла;
	
	Если      Тип = "РегистрыСведений" Тогда
		Рег = РегистрыСведений;
	ИначеЕсли Тип = "РегистрыНакопления" Тогда
		Рег = РегистрыНакопления;
	КонецЕсли;
	
	Рез = Новый Массив;
	
	Для Каждого ТекСтр Из Выб.Выборка Цикл
		Если Тип = "Последовательности" Тогда
			Отбор = Новый Структура(сИзмерения);
		КонецЕсли;
		
		Флаг = Ложь;
		
		Для Сч = 0 По Кол - 1 Цикл
			Поле = ТекСтр[Сч];
			Если ИзВнутр Тогда
				Поле = ЗначениеИзСтрокиВнутр(Поле);  
				ПроверкаНаБитуюСсылку(Поле,Флаг, ДанныеБазы);
			КонецЕсли;
			
			Если Тип = "РегистрыСведений"
			 Или Тип = "РегистрыНакопления"
			 Или Тип = "Последовательности"
			Тогда
				Отбор[Измерения[Сч]] = Поле;
			Иначе
				Значение = Поле; 
			КонецЕсли;
		КонецЦикла;
		
		Если Тип = "РегистрыСведений"
		 Или Тип = "РегистрыНакопления"
		Тогда
			Значение = Рег[Вид].СоздатьКлючЗаписи(Отбор);
			Если Тип = "РегистрыСведений" И Вид = "РасчетПоказателейОтложенногоНалога" Тогда
				Значение = Отбор.Регистратор;
			КонецЕсли;
		ИначеЕсли Тип = "Последовательности" Тогда
			Значение = Отбор;
		КонецЕсли;
		
		Если Флаг Тогда
		
			Продолжить;	
		
		КонецЕсли;
		
		Рез.Добавить(Значение);
	КонецЦикла;
	
	Выб.Вставить("Результат", Рез);
КонецПроцедуры

Процедура ПроверкаНаБитуюСсылку(Поле, Флаг, ДанныеБазы) 
	  
	  Попытка
		  Стр = Строка(Поле); 
		  Если СтрНайти(Стр,"<Объект не найден>")>0 Тогда
			  Флаг =  Истина	
		  КонецЕсли;   
	  Исключение       
		  Коммментарий = СтрШаблон("Поле: %1, Флаг: %2, %3", Поле, Флаг, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		  ЗаписьЖурналаРегистрации(НСтр("ru = 'Проверка синхронизации данных. ПроверкаНаБитуюСсылку'", ОбщегоНазначения.КодОсновногоЯзыка()),
		  УровеньЖурналаРегистрации.Ошибка, , ДанныеБазы.База.Ссылка, Коммментарий);   
	  КонецПопытки;   
	  
  КонецПроцедуры
  

Процедура ОбъединитьРез(соРазница, Рез, Тип)
	
	Для каждого эл Из соРазница Цикл
		Если Тип = "РегистрыСведений"  Тогда
			Рез.Добавить(эл);	
		Иначе
			Если эл.ПолучитьОбъект() <> Неопределено Тогда 
				Рез.Добавить(эл);	                               
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ЛокальныеЗапросы
Функция ВыполнитьЗапрос(ЗапросТекст, Поля, ЗапросПараметры, ДанныеБазы)
	База = ДанныеБазы.База;
	Запрос = Новый Запрос;
	Запрос.Текст = ОбменДаннымиПереопределяемый.АдаптироватьТекстЗапросаОборотов(ЗапросТекст);
	Для Каждого ТекПар Из ЗапросПараметры Цикл
		Ключ = ТекПар.Ключ;
		Зн = ТекПар.Значение;
		
		Если Ключ = "Организация" И ТипЗнч(Зн) = Тип("Строка") Тогда
			Зн = ОбменДаннымиПереопределяемый.Орг(Зн);
		КонецЕсли;
		
		Запрос.УстановитьПараметр(Ключ, Зн);
	КонецЦикла;
	
	мРезультат = Новый Массив;
	Попытка
		РезультатЗапроса = ОбменДаннымиПереопределяемый.ВыполнитьЗапросОборотов(Запрос);
	Исключение           
		Коммментарий = СтрШаблон("Ошибка выполнения запроса. Текст: %1%2Причина: %3", Запрос.Текст, Символы.ПС, 
		ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Проверка синхронизации данных. ВыполнитьЗапрос'", ОбщегоНазначения.КодОсновногоЯзыка()),
		УровеньЖурналаРегистрации.Ошибка, , База.Ссылка, Коммментарий);
		Возврат мРезультат;
	КонецПопытки;
	
	КолонкиРезультата = РезультатЗапроса.Колонки;
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Стр = Новый Массив;
		Для Каждого Изм Из Поля Цикл
			Зн = ОбменДаннымиПереопределяемый.ЗначениеПоляВыборки(Выборка, Изм, КолонкиРезультата);
			Если ТипЗнч(Зн) = Тип("УникальныйИдентификатор") Тогда
				Зн = ЗначениеВСтрокуВнутр(Строка(Зн));
			Иначе
				Зн = ЗначениеВСтрокуВнутр(Зн);
			КонецЕсли;
			Стр.Добавить(Зн);
		КонецЦикла;
		мРезультат.Добавить(Стр);
	КонецЦикла;
	
	Возврат мРезультат;
КонецФункции

Функция Орг(Знач ИД)

	Возврат ОбменДаннымиПереопределяемый.Орг(ИД);

КонецФункции  

#КонецОбласти
#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
